{
  "backend/main.mo": "Motoko canister implementing auth, user profiles with suspension, and post/comment creation with images, likes, and reporting.",
  "feature_evidence.json": "Feature-to-file mapping documenting implemented requirements, components, and test coverage.",
  "frontend-file-summaries.txt": "List of concise descriptions for all frontend source files to aid build planning.",
  "frontend/index.css": "Tailwind base and theme variables defining the app’s color system and dark mode styles.",
  "frontend/index.html": "HTML entrypoint loading the React app with metadata, icons, and manifest.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, and startup behavior.",
  "frontend/src/App.tsx": "Main app controller handling auth, username setup, navigation, and page rendering.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login view with branding and Internet Identity sign‑in flow.",
  "frontend/src/components/feed/CommentsThread.tsx": "UI for displaying comments, adding new ones with validation, and liking comments, respecting suspension rules.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a social post card with like, comment toggle, and reporting dialogs, handling identity checks and image fallback.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with header, notification badge, content area, and bottom navigation.",
  "frontend/src/components/nav/BottomNav.tsx": "Displays bottom navigation buttons for switching between main app pages.",
  "frontend/src/components/profile/UsernameSetupModal.tsx": "Modal for validating and submitting a new username with error handling and loading states.",
  "frontend/src/components/reporting/ReportAccountDialog.tsx": "Dialog to confirm reporting a user account, submitting the report and showing toast feedback.",
  "frontend/src/components/reporting/ReportPostDialog.tsx": "Dialog to report a post, triggering removal and adding a local notification for the reporter.",
  "frontend/src/constants/uploads.ts": "Defines allowed image MIME types and maximum upload file size.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, posts, comments, likes, and reports via an actor API.",
  "frontend/src/hooks/useSuspensionStatus.ts": "Determines whether the current user is suspended by comparing current time to their suspension timestamp.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark themes and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/moderation/disallowedTerms.ts": "Provides a list of banned terms plus normalization and detection utilities for moderation.",
  "frontend/src/moderation/validateTextContent.ts": "Validates text content for emptiness and disallowed terms.",
  "frontend/src/moderation/validateUsername.ts": "Validates usernames for length, character rules, and disallowed terms.",
  "frontend/src/notifications/localNotificationsStore.ts": "Manages localStorage-based notifications per user, including read state and retrieval.",
  "frontend/src/notifications/notificationTypes.ts": "Defines notification types and the structure of a notification object.",
  "frontend/src/pages/CreatePostPage.tsx": "Page for creating posts with text and optional images, including moderation and suspension checks.",
  "frontend/src/pages/FeedPage.tsx": "Displays the list of posts with manual refresh and loading states.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays local notifications with icons, timestamps, and read-state handling.",
  "frontend/src/pages/PollsPage.tsx": "Renders the weekly poll UI, creating polls, handling voting, and showing messages based on the poll time window.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile details, suspension status, and logout functionality along with app information.",
  "frontend/src/polls/extractWeeklyTopics.ts": "Extracts and ranks top weekly discussion topics from posts/comments with normalization, stop-word filtering, and fallbacks.",
  "frontend/src/polls/localPollStore.ts": "Manages per-user weekly poll data in localStorage, including creation, retrieval, and vote submission with validation.",
  "frontend/src/polls/pollTimeWindow.ts": "Defines the weekly poll schedule and determines whether voting is open, results are visible, or polls are unavailable.",
  "frontend/src/utils/imageFileValidation.ts": "Validates image uploads by checking MIME type and file size against predefined limits.",
  "frontend/src/utils/timeFormat.ts": "Provides helpers to format timestamps and suspension end times into human-readable strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for handling URL and session-stored parameters, including extraction, persistence, and cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS settings, themes, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Represents the current state of the Hornet Hive project, outlining app goals, required moderation systems, image assets, and implemented features with versioning. Contains architectural notes, feature definitions, and project metadata used for build planning."
}