{
  "backend/main.mo": "Motoko backend implementing user profiles, permissions, posts, comments, likes, and suspension checks with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing files, components, and test IDs for the delete-post UI flow.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables, light/dark mode tokens, and base utility layers.",
  "frontend/index.html": "Base HTML entry point configuring meta tags, icons, manifest, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining the app name, icons, theme colors, and startup behavior.",
  "frontend/src/App.tsx": "Root React component handling authentication, username setup flow, navigation, and page rendering.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen with branding and Internet Identity sign-in handling.",
  "frontend/src/components/feed/CommentsThread.tsx": "Renders a post’s comments and provides UI for adding and liking comments with suspension and validation checks.",
  "frontend/src/components/feed/DeletePostDialog.tsx": "Confirmation dialog for deleting a post using a mutation with success/error handling and toast notifications.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a post with author info, content, image, like button, comments, and menus for reporting or deleting depending on ownership.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, unread notifications badge, content area, and bottom navigation.",
  "frontend/src/components/nav/BottomNav.tsx": "Provides a fixed bottom navigation bar with buttons to switch between core app pages.",
  "frontend/src/components/polls/WeeklyPollPanel.tsx": "Displays the weekly poll with voting, state messaging, and results depending on poll status.",
  "frontend/src/components/profile/UsernameSetupModal.tsx": "Modal for validating and submitting a new username using mutation logic with error handling.",
  "frontend/src/components/reporting/ReportAccountDialog.tsx": "Dialog for confirming and submitting a user account report with status feedback.",
  "frontend/src/components/reporting/ReportPostDialog.tsx": "Dialog for reporting a post, submitting a mutation, and creating a local notification for the reporter.",
  "frontend/src/constants/uploads.ts": "Defines allowed image MIME types and the maximum upload file size.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, posts, and interactions via the backend actor.",
  "frontend/src/hooks/useSuspensionStatus.ts": "Computes whether the current user is suspended based on their profile and returns suspension state info.",
  "frontend/src/index.css": "Sets up Tailwind base styles and color variables for light/dark themes with additional utility rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/moderation/disallowedTerms.ts": "Defines a list of banned terms and functions to normalize text and detect inappropriate content.",
  "frontend/src/moderation/validateTextContent.ts": "Validates text content for emptiness and disallowed terms.",
  "frontend/src/moderation/validateUsername.ts": "Validates usernames for length, allowed characters, and disallowed terms.",
  "frontend/src/notifications/localNotificationsStore.ts": "Implements localStorage‑based read/write utilities for storing and updating user notifications.",
  "frontend/src/notifications/notificationTypes.ts": "Defines notification types and the notification data structure.",
  "frontend/src/pages/CreatePostPage.tsx": "UI and logic for creating posts, including content validation, image upload, and suspension checks.",
  "frontend/src/pages/FeedPage.tsx": "Displays the post feed with refresh controls and includes the weekly poll panel.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications, showing icons, timestamps, and marking items as read when clicked.",
  "frontend/src/pages/PollsPage.tsx": "Renders the weekly poll page using the WeeklyPollPanel component.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile details, suspension status, and logout functionality with informational cards.",
  "frontend/src/polls/extractWeeklyTopics.ts": "Extracts top weekly topics from posts/comments by normalizing text, filtering stop words, and ranking by frequency.",
  "frontend/src/polls/localPollStore.ts": "Manages poll state in localStorage, including creation, retrieval, week checks, and submitting votes.",
  "frontend/src/polls/pollTimeWindow.ts": "Defines poll timing logic and computes current week ID and voting/result visibility windows.",
  "frontend/src/polls/useWeeklyPoll.ts": "Hook that initializes weekly polls, handles voting, generates topics, and manages poll state updates.",
  "frontend/src/utils/imageFileValidation.ts": "Validates image uploads by checking file type and size limits.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into relative times and formats suspension end dates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, and clearing URL parameters, including session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s state, including summary, architecture notes, features, and configuration for the Hornet Hive mobile app."
}