{
  "backend/main.mo": "Main backend canister combining storage and authorization, managing user profiles, posts, comments, and permissions with username uniqueness and suspension checks.",
  "backend/migration.mo": "Migration logic converting old posts and comments to new structures by adding likedBy sets while preserving existing data.",
  "feature_evidence.json": "Metadata file documenting feature evidence for UI handling of duplicate-like errors linked to specific frontend files and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles across auth, feed, moderation, polls, notifications, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying base styling.",
  "frontend/index.html": "HTML entry point loading the React app with metadata, icons, and manifest references.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, colors, and display configuration.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile bootstrap watchdog, error handling, navigation, and page rendering.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen component showing user-friendly bootstrap and network error messages with retry and logout actions.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen using Internet Identity with styled sign-in UI and loading state.",
  "frontend/src/components/feed/CommentsThread.tsx": "Renders a post’s comment thread with posting, liking, deleting, and reporting comments, including suspension checks and validation.",
  "frontend/src/components/feed/DeleteCommentDialog.tsx": "Confirmation dialog for deleting a comment, triggering delete mutation and showing toast feedback.",
  "frontend/src/components/feed/DeletePostDialog.tsx": "Confirmation dialog for deleting a post and its comments, using a delete mutation with toast notifications.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a post with author info, content, actions, image handling, like button, and menus for reporting or deleting.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, sharing, notifications badge, page content area, and bottom navigation.",
  "frontend/src/components/nav/BottomNav.tsx": "Bottom navigation bar allowing page switching with icons for feed, posting, polls, and profile.",
  "frontend/src/components/polls/WeeklyPollPanel.tsx": "Weekly poll UI handling voting states, topic selection, and result display with compact and full layouts.",
  "frontend/src/components/profile/UsernameSetupModal.tsx": "Modal for setting a unique username with validation and mutation submission.",
  "frontend/src/components/reporting/ReportAccountDialog.tsx": "Dialog to report a user account, triggering a mutation and showing success or error toasts.",
  "frontend/src/components/reporting/ReportCommentDialog.tsx": "Dialog for reporting a comment, calling a mutation, removing it from the feed, and adding a local notification.",
  "frontend/src/components/reporting/ReportPostDialog.tsx": "Dialog to report a post, invoking a mutation, removing it from the feed, and adding a local notification.",
  "frontend/src/constants/uploads.ts": "Defines allowed image MIME types and a 5MB maximum upload size.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and stored identity handling using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, posts, and other backend data with timeout logic.",
  "frontend/src/hooks/useSuspensionStatus.ts": "Derives whether the current user is suspended based on their profile’s suspension timestamp.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, dark mode, and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/moderation/disallowedTerms.ts": "Lists banned terms and provides normalization and detection helpers for moderation.",
  "frontend/src/moderation/validateTextContent.ts": "Validates text content for emptiness and disallowed terms.",
  "frontend/src/moderation/validateUsername.ts": "Validates usernames for length, character rules, and disallowed content.",
  "frontend/src/notifications/localNotificationsStore.ts": "Manages notification storage in localStorage, including retrieval, creation, marking read, and unread counts.",
  "frontend/src/notifications/notificationTypes.ts": "Defines notification types and the Notification interface.",
  "frontend/src/pages/CreatePostPage.tsx": "UI for creating posts with text and optional images, including validation, upload progress, and suspension checks.",
  "frontend/src/pages/FeedPage.tsx": "Fetches and displays the main post feed with refresh control and weekly poll panel.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays user notifications with icons and marks items as read when clicked.",
  "frontend/src/pages/PollsPage.tsx": "Shows the weekly poll panel page.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile info, suspension status, sharing options, and logout.",
  "frontend/src/polls/extractWeeklyTopics.ts": "Extracts top topics from weekly post/comment text using normalization, stop-word removal, and frequency sorting.",
  "frontend/src/polls/localPollStore.ts": "Stores weekly poll data in localStorage, handles creation, retrieval, and voting with week-based resets.",
  "frontend/src/polls/pollTimeWindow.ts": "Determines poll week IDs and current poll state based on weekday rules.",
  "frontend/src/polls/useWeeklyPoll.ts": "React hook managing weekly poll lifecycle, topic extraction, voting, and poll availability notifications.",
  "frontend/src/utils/imageFileValidation.ts": "Validates image file type and size against allowed formats and max size constants.",
  "frontend/src/utils/shareHornetHive.ts": "Provides sharing utilities using Web Share API with clipboard and legacy fallbacks.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into relative time strings and readable suspension end dates.",
  "frontend/src/utils/urlParams.ts": "Retrieves, stores, and clears URL and session parameters with support for hash routing.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if it does not resolve in time.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Defines project metadata, architectural notes, and feature requests for preventing duplicate comment likes."
}