{
  "backend/main.mo": "Main backend actor integrating storage, auth, user profiles, posts, comments, likes, reporting, and post ordering with persistent state.",
  "backend/migration.mo": "Migration module converting old posts to a new format by adding an empty likedBy set and returning an updated actor state.",
  "feature_evidence.json": "Feature evidence report documenting frontend handling of duplicate-like attempts with linked file and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing components, hooks, validation, moderation, and UI behavior.",
  "frontend/index.css": "Global Tailwind CSS configuration defining light/dark theme variables and base styling rules.",
  "frontend/index.html": "HTML entry point setting metadata, app icons, manifest, and mounting the React root element.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, icons, theme color, and display mode.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile loading watchdog, error states, and navigation between pages.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen component showing friendly messages, technical details, and retry/logout actions when bootstrap fails.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen with branding and Internet Identity sign-in button including loading state.",
  "frontend/src/components/feed/CommentsThread.tsx": "Renders a post’s comments, handles adding, liking, deleting, and reporting comments with validation and suspension checks.",
  "frontend/src/components/feed/DeleteCommentDialog.tsx": "Confirmation dialog for deleting a comment, performing the delete mutation and showing toast feedback.",
  "frontend/src/components/feed/DeletePostDialog.tsx": "Confirmation dialog for deleting a post and its comments using a delete mutation with toast notifications.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a post with author info, content, actions, liking, reporting, deleting, and an expandable comments thread.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, share and notification controls, content area, and bottom navigation.",
  "frontend/src/components/nav/BottomNav.tsx": "Bottom navigation bar allowing users to switch between core app pages like feed, create, polls, and profile.",
  "frontend/src/components/polls/WeeklyPollPanel.tsx": "Shows the weekly poll, allowing voting or viewing results depending on poll state.",
  "frontend/src/components/profile/UsernameSetupModal.tsx": "Modal for choosing and validating a unique username, submitting via mutation with error handling.",
  "frontend/src/components/reporting/ReportAccountDialog.tsx": "Confirmation dialog that reports a user account via mutateAsync and shows toast messages.",
  "frontend/src/components/reporting/ReportCommentDialog.tsx": "Dialog for reporting a comment, triggering mutation, local notification, and toast feedback.",
  "frontend/src/components/reporting/ReportPostDialog.tsx": "Dialog to report a post, submitting a mutation and adding a local notification for the reporter.",
  "frontend/src/constants/uploads.ts": "Defines allowed image MIME types and a 5MB upload size limit.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating posts, profiles, and user data using the backend actor.",
  "frontend/src/hooks/useSuspensionStatus.ts": "Determines whether the current user is suspended and returns suspension end time.",
  "frontend/src/index.css": "Tailwind base styles and color variables for light and dark themes with utility resets.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/moderation/disallowedTerms.ts": "Defines prohibited terms and utilities for normalizing text and detecting disallowed content.",
  "frontend/src/moderation/validateTextContent.ts": "Validates text content for emptiness and inappropriate terms.",
  "frontend/src/moderation/validateUsername.ts": "Validates usernames for length, character rules, and disallowed terms.",
  "frontend/src/notifications/localNotificationsStore.ts": "Manages per-user notifications in localStorage, including retrieval, creation, read-state updates, and unread counts.",
  "frontend/src/notifications/notificationTypes.ts": "Defines notification types and the Notification interface structure.",
  "frontend/src/pages/CreatePostPage.tsx": "UI for creating posts with text and optional image upload, including validation, suspension checks, and mutation handling.",
  "frontend/src/pages/FeedPage.tsx": "Displays the main feed of posts with refresh controls and includes the weekly poll panel.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows stored notifications for the current user with icons and read-state handling.",
  "frontend/src/pages/PollsPage.tsx": "Renders the weekly poll panel on its own page.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile info, suspension warnings, sharing options, and logout handling.",
  "frontend/src/polls/extractWeeklyTopics.ts": "Extracts top topic keywords from posts/comments using normalized word frequency and stopword filtering.",
  "frontend/src/polls/localPollStore.ts": "Stores weekly poll data per user in localStorage, including creation, retrieval, and voting logic.",
  "frontend/src/polls/pollTimeWindow.ts": "Provides time-window rules and helpers for weekly poll availability, voting, and results.",
  "frontend/src/polls/useWeeklyPoll.ts": "React hook managing poll lifecycle, topic generation, voting, and poll-availability notifications.",
  "frontend/src/utils/imageFileValidation.ts": "Validates image files by checking allowed MIME types and enforcing a maximum size limit.",
  "frontend/src/utils/shareHornetHive.ts": "Implements a share utility using Web Share API with clipboard and legacy fallbacks, plus helpers for copying links and checking support.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into relative time strings or readable suspension end dates.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for extracting, storing, retrieving, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if it exceeds a specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing state, issues, and feature requests related to enforcing one-like-per-student-per-post."
}