{
  "backend/main.mo": "Motoko backend integrating authorization and blob storage, managing user profiles and handling posts, comments, likes, and reporting with permission checks and suspension logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of multiple frontend components, hooks, utilities, and moderation modules.",
  "frontend/docs/production-release-notes.md": "Release notes outlining weekly poll enhancements, behavior details, lifecycle states, and publish verification steps.",
  "frontend/docs/publish-to-production.md": "Guide explaining how to promote a draft build to production, including checklist, steps, data preservation, and troubleshooting.",
  "frontend/docs/smoke-test-production.md": "Production smoke test checklist covering login, profiles, feed, polling, voting, and results validation after deployment.",
  "frontend/docs/smoke-test-results.md": "Template for recording production smoke test results with categories, pass/fail statuses, and detailed notes.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying base background, text, and border styles.",
  "frontend/index.html": "Basic HTML entry point that loads the app root, metadata, icons, and main TypeScript module.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying name, colors, start behavior, and app icons.",
  "frontend/src/App.tsx": "Main application component handling authentication, actor and profile loading, watchdog timeouts, and routing to primary pages.",
  "frontend/src/components/auth/AppErrorBoundary.tsx": "React error boundary that captures render errors, logs them, and shows a fallback screen with reset support.",
  "frontend/src/components/auth/AppErrorFallbackScreen.tsx": "Displays a detailed error UI with technical diagnostics, reload/logout actions, and boot phase data.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Shows user-friendly bootstrap failure messages with retry/logout options and diagnostic details.",
  "frontend/src/components/auth/GlobalAsyncErrorHandler.tsx": "Catches uncaught async errors and unhandled promise rejections and displays the fallback error screen.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login UI that triggers Internet Identity authentication with loading feedback and branding.",
  "frontend/src/components/feed/CommentsThread.tsx": "Renders a post’s comments, allowing users to add, like, delete, and report comments with validation and suspension checks.",
  "frontend/src/components/feed/DeleteCommentDialog.tsx": "Confirmation dialog to delete a comment, triggering a delete mutation and showing toast feedback.",
  "frontend/src/components/feed/DeletePostDialog.tsx": "Confirmation dialog for deleting a post, including mutation handling and success/error toasts.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a post with actions for liking, reporting, deleting, and toggling comments.",
  "frontend/src/components/layout/AppShell.tsx": "App layout with header, share button, notifications badge, main content area, and bottom navigation.",
  "frontend/src/components/nav/BottomNav.tsx": "Bottom navigation bar allowing page switching between feed, create, polls, and profile.",
  "frontend/src/components/polls/WeeklyPollPanel.tsx": "Weekly poll UI handling voting, custom responses, validation, and state-based display.",
  "frontend/src/components/profile/UsernameSetupModal.tsx": "Modal for selecting and validating a unique username with server-side mutation.",
  "frontend/src/components/reporting/ReportAccountDialog.tsx": "Modal dialog to report a user account, triggering a mutation and showing success or error toasts.",
  "frontend/src/components/reporting/ReportCommentDialog.tsx": "Dialog for reporting a comment, submitting a mutation, adding a local notification, and closing on success.",
  "frontend/src/components/reporting/ReportPostDialog.tsx": "Dialog for reporting a post, calling the report mutation and adding a local notification before closing.",
  "frontend/src/constants/uploads.ts": "Defines allowed image MIME types and a 5MB maximum upload size.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useActorStatus.ts": "Wraps useActor to expose loading, error, and retry status for actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating posts, profiles, usernames, and related data through the actor.",
  "frontend/src/hooks/useSuspensionStatus.ts": "Determines whether the current user is suspended and returns suspension end time if applicable.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark themes, including layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/moderation/disallowedTerms.ts": "Defines a normalized list of disallowed terms and provides utilities to detect them in text using word-boundary regex matching.",
  "frontend/src/moderation/validateTextContent.ts": "Validates user text for emptiness and checks for disallowed terms.",
  "frontend/src/moderation/validateUsername.ts": "Validates usernames for length, allowed characters, and presence of disallowed terms.",
  "frontend/src/notifications/localNotificationsStore.ts": "Manages localStorage-based notifications, including retrieval, creation, marking as read, and unread counts.",
  "frontend/src/notifications/notificationTypes.ts": "Defines notification types and the Notification interface used across the app.",
  "frontend/src/pages/CreatePostPage.tsx": "UI for creating posts with text and optional images, validating content, handling suspensions, and submitting via mutation.",
  "frontend/src/pages/FeedPage.tsx": "Displays the main feed of posts with refresh capability and an embedded weekly poll panel.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows local notifications, marking them as read and displaying icons based on notification type.",
  "frontend/src/pages/PollsPage.tsx": "Displays the weekly poll panel with explanatory text about the voting schedule.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile info, suspension status, share options, and logout functionality.",
  "frontend/src/polls/extractWeeklyTopics.ts": "Provides deterministic extraction of trending topics from post and comment text using word frequency analysis.",
  "frontend/src/polls/localPollStore.ts": "Manages poll creation, retrieval, storage, and voting in localStorage with weekly reset logic.",
  "frontend/src/polls/pollTimeWindow.ts": "Provides date utilities defining weekly poll windows and determining poll state based on local time.",
  "frontend/src/polls/useWeeklyPoll.ts": "React hook that initializes weekly polls, filters posts, handles voting, and exposes poll UI state.",
  "frontend/src/utils/actorInitError.ts": "Normalizes actor initialization errors into categories like connectivity or authentication.",
  "frontend/src/utils/bootDiagnostics.ts": "Tracks boot phases and errors, providing snapshots and summaries for startup debugging.",
  "frontend/src/utils/imageFileValidation.ts": "Validates uploaded image files for type and size limits.",
  "frontend/src/utils/safeErrorLogging.ts": "Logs errors with sensitive data redacted and includes boot diagnostics; formats safe UI error output.",
  "frontend/src/utils/shareHornetHive.ts": "Implements sharing via Web Share API with clipboard and legacy fallbacks.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into relative or date-based strings, including suspension end times.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if it exceeds a specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing existing features, issues, and metadata for a connectivity‑error‑handling fix."
}