{
  "kind": "build_request",
  "title": "Prevent duplicate likes on the same comment by the same student",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enforce a one-like-per-student-per-comment rule in the backend so the same authenticated caller cannot successfully like the same comment more than once.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-8"
        ],
        "quotes": [
          "Make it so that the same student cannot like the same comment multiple times."
        ]
      },
      "acceptanceCriteria": [
        "Calling likeComment(postId, commentId) the first time increments that comment's likes by exactly 1.",
        "Calling likeComment(postId, commentId) again from the same caller does not change the comment's likes count.",
        "The second (and subsequent) like attempts from the same caller for the same comment return a clear error (trap) message in English (e.g., \"You have already liked this comment.\").",
        "Different authenticated callers can each like the same comment once, and each successful like increments the likes count by 1."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Surface duplicate-like errors in the UI when liking a comment, showing an English user-facing message rather than failing silently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-8"
        ],
        "quotes": [
          "Make it so that the same student cannot like the same comment multiple times."
        ]
      },
      "acceptanceCriteria": [
        "If the backend rejects a duplicate comment-like attempt, the user sees an English error message (e.g., via toast or an inline alert) indicating they already liked the comment.",
        "The UI remains responsive after the error (the user can continue browsing/liking other comments)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing unlike/toggle-like behavior for comments.",
    "Preventing duplicate likes on posts (only comments are in scope).",
    "Adding real-time updates beyond existing React Query invalidation/polling behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}