{
  "kind": "build_request",
  "title": "Prevent the same student from liking the same post multiple times",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enforce a one-like-per-student-per-post rule in the backend so the same authenticated caller cannot successfully like the same post more than once.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Make it so that the same student cannot like the same post multiple times."
        ]
      },
      "acceptanceCriteria": [
        "Given a post, when the same authenticated principal calls likePost(postId) twice, the post’s like count increases by at most 1 total.",
        "The backend stores per-post like ownership (who liked) so the rule is enforced even if the user refreshes or retries.",
        "The backend returns a deterministic error message when a duplicate like is attempted (e.g., contains the phrase \"already liked\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend post-like UI to gracefully handle a duplicate-like attempt by showing an English user-facing message instead of failing silently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Make it so that the same student cannot like the same post multiple times."
        ]
      },
      "acceptanceCriteria": [
        "When a user taps Like on the same post more than once and the backend rejects it, the UI shows a toast (or equivalent) stating the user has already liked the post.",
        "The Like button returns to a non-loading state after the duplicate-like attempt completes.",
        "Non-duplicate errors during post like show a generic English error message (e.g., \"Failed to like post. Please try again.\")."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If existing persisted post data must be upgraded, add/extend conditional migration logic so existing posts initialize the new per-post liked-by tracking without breaking getPosts or likePost.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Make it so that the same student cannot like the same post multiple times."
        ]
      },
      "acceptanceCriteria": [
        "After upgrade/migration, existing posts remain readable via getPosts.",
        "After upgrade/migration, likePost works for posts created before the upgrade and still enforces one-like-per-student-per-post."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Add an \"unlike\" feature or toggle-like behavior for posts.",
    "Change the existing comment-like behavior beyond what is necessary to keep it working.",
    "Display per-user liked state (e.g., filled heart) for posts unless already available without adding new backend fields to PostView."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}