{
  "kind": "build_request",
  "title": "Fix bootstrap connectivity error by surfacing actor initialization failures and improving retries",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the actor initialization hook so that failures to create the backend actor are surfaced to the app (instead of leaving the actor as null), including exposing an Error object and loading/error flags to consumers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Error: Unable to connect to the service. Please check your connection and try again. Fix this"
        ]
      },
      "acceptanceCriteria": [
        "When backend actor creation fails (e.g., agent/canister unreachable), the hook exposes a non-null error state (not just actor=null).",
        "The error object contains the original failure message (or a sanitized, more specific message) so the UI can display something more accurate than a generic connection error.",
        "No changes are made to any files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose behavior elsewhere if needed)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the app bootstrap/profile-loading flow so it does not throw the generic \"Unable to connect to the service\" error solely because the actor is null while an actor initialization error already exists; instead, show the real initialization error (or timeout) in the existing BootstrapErrorScreen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Error: Unable to connect to the service. Please check your connection and try again. Fix this"
        ]
      },
      "acceptanceCriteria": [
        "If actor initialization fails, the bootstrap error screen displays an appropriate user-facing message (e.g., timed out / unable to reach service) and the Technical details section includes the underlying error message.",
        "If actor initialization is still in progress, the app stays in a loading state until either actor initialization succeeds or a defined timeout occurs.",
        "The specific user-facing text \"Unable to connect to the service. Please check your connection and try again.\" is only shown when it is the best available diagnosis (e.g., offline/unreachable), not as a catch-all for any actor-null state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the Retry action on the bootstrap error screen reliably recover from transient connection/agent issues by forcing a fresh actor initialization and then re-running the profile fetch without requiring a full page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Error: Unable to connect to the service. Please check your connection and try again. Fix this"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Try Again triggers a new actor initialization attempt (not blocked by cached query state) and then refetches the caller profile.",
        "If the service becomes available, the user successfully reaches the app without seeing the error screen again.",
        "If the service is still unavailable, the error screen remains and the technical details reflect the most recent failure attempt."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Adding new authentication methods (only Internet Identity is supported).",
    "Adding real-time/WebSocket connectivity checks.",
    "Changing weekly poll functionality or unrelated feed/profile features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}