{
  "kind": "build_request",
  "title": "Allow students to delete their own posts",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Add a backend capability for an authenticated student to delete a post they authored, and prevent deletion by non-authors.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Make it possible for students to delete their own posts if they want."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new shared method to delete a post by postId.",
        "If caller is not authenticated (no #user permission), the method traps with an \"Unauthorized\" error.",
        "If caller is authenticated but is not the author of the post, the method traps with a clear error (e.g., \"You can only delete your own posts\").",
        "If the post does not exist, the method traps with a clear error (e.g., \"Post not found\").",
        "On successful deletion, the post is removed from persistent storage and no longer appears in getPosts().",
        "If the post had comments, they are removed along with the deleted post (since the entire post is removed).",
        "If the post had an image attached, the deletion path must ensure the image is no longer accessible via the app (and should remove the stored blob if supported by the current blob-storage API)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add a frontend UI flow that lets a signed-in student delete their own post from the feed, with a confirmation dialog and automatic feed refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Make it possible for students to delete their own posts if they want."
        ]
      },
      "acceptanceCriteria": [
        "For posts authored by the current signed-in user, the post card shows an overflow/menu action that includes a \"Delete Post\" option.",
        "Tapping \"Delete Post\" opens a confirmation dialog with English text that clearly warns the action is permanent (e.g., title \"Delete this post?\", confirm button \"Delete\", cancel button \"Cancel\").",
        "Confirming deletion calls a new React Query mutation hook that invokes the backend delete-post method.",
        "On success, the posts query is invalidated/refetched so the deleted post disappears from the feed without a manual refresh.",
        "On failure, a user-visible English error message is shown (toast or inline) using the error message returned from the backend when available.",
        "The existing reporting menu/actions for non-own posts remain available and unchanged (i.e., only the author sees delete; non-authors see report actions)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Deleting comments independently of deleting the parent post.",
    "Moderator/admin deletion of other students' posts.",
    "Undo/restore functionality for deleted posts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}