{
  "kind": "build_request",
  "title": "Add in-app share function to share Hornet Hive with friends",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add an in-app \"Share Hornet Hive\" action that lets a signed-in student share the app using the device/browser system share sheet when available (Web Share API).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Add a share app function so students can share the app with friends"
        ]
      },
      "acceptanceCriteria": [
        "A clearly labeled share action (e.g., a button) is available in the signed-in app UI (recommended placement: Profile page).",
        "On supported platforms, tapping the share action opens the native/system share sheet via the Web Share API.",
        "The shared payload includes at minimum: title \"Hornet Hive\", a short text invite message in English, and a URL pointing to the current app origin (e.g., window.location.origin)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Provide a non-Web-Share fallback so sharing still works on browsers/devices that do not support the Web Share API.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Add a share app function so students can share the app with friends"
        ]
      },
      "acceptanceCriteria": [
        "If navigator.share is unavailable or fails, the UI offers a \"Copy link\" fallback that copies the app URL to the clipboard (navigator.clipboard when available).",
        "User receives clear success/error feedback using the existing toast system (sonner) with English messages (e.g., \"Link copied\" / \"Could not copy link\").",
        "The share flow never crashes the app; failures are handled gracefully and keep the user on the same screen."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; no new backend services."
  ],
  "nonGoals": [
    "Do not add sharing of individual posts/comments (this request is for sharing the app itself).",
    "Do not integrate third-party social APIs or SDKs.",
    "Do not require Internet Identity or backend changes to complete the share action."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}