{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend: Delete own posts from feed",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Let a signed-in student delete their own post from the feed with confirmation, backend call, and automatic refresh while preserving report actions for non-authors.",
      "acceptanceCriteria": [
        "For posts authored by the current signed-in user, the post card shows an overflow/menu action that includes a \"Delete Post\" option.",
        "Tapping \"Delete Post\" opens a confirmation dialog with English text that clearly warns the action is permanent (e.g., title \"Delete this post?\", confirm button \"Delete\", cancel button \"Cancel\").",
        "Confirming deletion calls a new React Query mutation hook that invokes the backend delete-post method.",
        "On success, the posts query is invalidated/refetched so the deleted post disappears from the feed without a manual refresh.",
        "On failure, a user-visible English error message is shown (toast or inline) using the error message returned from the backend when available.",
        "The existing reporting menu/actions for non-own posts remain available and unchanged (i.e., only the author sees delete; non-authors see report actions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook (e.g., useDeletePost) that calls the existing backend capability actor.deletePost(postId) and invalidates the ['posts'] query on success; surface thrown errors so UI can display backend-provided messages when available."
        },
        {
          "path": "frontend/src/components/feed/DeletePostDialog.tsx",
          "operation": "create",
          "description": "Create a confirmation dialog component for deleting a post using the existing shadcn/ui AlertDialog components (do not modify ui files). The dialog must use English text warning deletion is permanent, call the useDeletePost mutation on confirm, close on success, and show user-visible error feedback via sonner toast on failure. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/feed/PostCard.tsx",
          "operation": "modify",
          "description": "Update the post overflow/menu logic to show an overflow/menu for the author’s own posts containing a \"Delete Post\" action while keeping the existing report actions unchanged for non-authors. Wire the new DeletePostDialog into PostCard state (open/close) and trigger it from the \"Delete Post\" menu item; on successful deletion rely on query invalidation to refresh the feed."
        }
      ]
    }
  ]
}